//  int main()
//  {
// // 			//TESTING PRINTF %d//
// // 	//точность равна длинне числа без знака ширина больше числа флаг +
// // 	printf("%s\n", "точность равна длинне числа без знака ширина больше числа флаг +");
// // 	printf("%+7.3d|\n",888);
// // 	ft_printf("%+7.3d",888);
// // 	printf("%s\n", "________________________________________________________");

// // 	//точность меньше ширины но больше числа с флагом +, положительно число
// // 	printf("%s\n", "точность меньше ширины но больше числа с флагом +, положительно число");
// // 	   printf("%+7.4d|\n",888);
// // 	ft_printf("%+7.4d",888);
// // 	printf("%s\n", "________________________________________________________");
// // 	//точность больше ширины с флагом +, положительное число
// // 	printf("%s\n", "точность больше ширины с флагом +, положительное число");
// // 	printf("%+7.9d|\n",888);
// // 	ft_printf("%+7.9d",888);
// // 	printf("%s\n", "________________________________________________________");
// // 	//точность больше ширины отрицательное число
// // 	printf("%s\n", "точность больше ширины с флагом +, отрицательное число");
// // 	printf("%+7.9d|\n",-888);
// // 	ft_printf("%+7.9d",-888);
// // 	printf("%s\n", "________________________________________________________");
// // 	//точность меньше ширины, отрицательно число
// // 	printf("%s\n", "точность меньше ширине с флагом +, положительно число");
// // 	printf("%+7.4d|\n",-888);
// // 	ft_printf("%+7.4d",-888);
// // 	printf("%s\n", "________________________________________________________");
// // 	//ширина больше числа отрицательное число
// // 	printf("%s\n", "ширина больше числа отрицательное число");
// // 	printf("%7d|\n",-888);
// // 	ft_printf("%7d",-888);
// // 	printf("%s\n", "________________________________________________________");
// // 	//ширина меньше числа отрицательно число
// // 	printf("%s\n", "ширина больше числа отрицательное число");
// // 	printf("%2d|\n",-888);
// // 	ft_printf("%2d",-888);
// // 	printf("%s\n", "________________________________________________________");
// // 	//ширина равна числу отрицательно число
// // 	printf("%s\n", "ширина равна числу отрицательное число");
// // 	printf("%3d|\n",-888);
// // 	ft_printf("%3d",-888);
// // 	printf("%s\n", "________________________________________________________");
// // 	//ширина равна числу +знак отрицательно число
// // 	printf("%s\n", "ширина равна числу +знак отрицательное число");
// // 	printf("%4d|\n",-888);
// // 	ft_printf("%4d",-888);
// // 	printf("%s\n", "________________________________________________________");
// // 	//ширина больше отрицательно числа число флаг -
// // 	printf("%s\n", "ширина больше числа знак отрицательно число флаг -");
// // 	printf("%-10d|\n",-888);
// // 	ft_printf("%-10d",-888);
// // 	printf("%s\n", "________________________________________________________");
// // 	//ширина меньше отрицательного числа флаг -
// // 	printf("%s\n", "ширина меньше отрицательного числа флаг -");
// // 	printf("%-3d|\n",-888);
// // 	ft_printf("%-3d",-888);
// // 	printf("%s\n", "________________________________________________________");
// // 	//ширина равна отрицательному числу флаг -
// // 	printf("%s\n", "ширина равна отрицательному числу флаг -");
// // 	printf("%-4d|\n",-888);
// // 	ft_printf("%-4d",-888);
// // 	printf("%s\n", "________________________________________________________");
// // 	//ширина равно 0 точность 0 отрицательное число
// // 	printf("%s\n", "ширина равно 0 точность 0 отрицательное число");
// // 	printf("%-4d|\n",-888);
// // 	ft_printf("%-4d",-888);
// // 	printf("%s\n", "________________________________________________________");

// // 	//флаг 0 , -, точность равна 5
// // 	printf("%s\n", "флаг 0 , -, точность равна 5");
// // 	printf("%0-.5d|\n",-888);
// // 	ft_printf("%0-.5d",-888);
// // 	printf("%s\n", "________________________________________________________");
// // 	//#0-+12.7d
// // 	printf(">>>%s<<<\n","#0-+12.7d");
// // 	printf("%#0-+12.7d|\n", 25);
// // 	ft_printf("%#0-+12.7d\n", 25);
// // 	printf("%s\n", "________________________________________________________");
// // 	//#0-+12.7d
// // 	printf(">>>%s<<<\n","#-+ 015.4");
// // 	printf("%#-+ 015.4d|\n", 25);
// // 	ft_printf("%#-+ 015.4d\n", 25);
// // 	printf("%s\n", "________________________________________________________");

// // 	printf(">>>%s<<<\n","#-+ 015.3");
// // 	printf("%#-+ 015.3d|\n", 25);
// // 	ft_printf("%#-+ 015.3d\n", 25);
// // 	printf("%s\n", "________________________________________________________");

// // 	ft_printf("%d", 2147483647);
// // 	ft_printf("%+d", 42);
// // 	ft_printf("%d\n", 0);
// //  	ft_printf("%0+5d", 42);
// //  	ft_printf("%05d", -42);
// //  	printf("%05d|", -42);

// //  	ft_printf("%d\n", -2147483648);
// // 	return 0;

//  	//ft_printf("%%");
 	
//  	//ft_printf("%5%");
//  	ft_printf("%%|");
//  	printf("\n");
//  	printf("%%|");
//  }
